In [1]:
import numpy as np
import pandas as pd

# csv , 를 기준 
# tsv tab을 기준

In [2]:
dataVar = pd.read_csv('data/gapminder.tsv',sep = '\t')
dataVar.shape

(1704, 6)

In [3]:
dataVar.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [4]:
dataVar.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [5]:
dataVar.country.head(3)

0    Afghanistan
1    Afghanistan
2    Afghanistan
Name: country, dtype: object

In [6]:
dataVar[['country','continent']].head(3)

       country continent
0  Afghanistan      Asia
1  Afghanistan      Asia
2  Afghanistan      Asia

In [7]:
dataVar.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [8]:
len(dataVar)

1704

In [9]:
dataVar.loc[dataVar.shape[0]-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [10]:
dataVar.iloc[[1,5,10]]

        country continent  year  lifeExp       pop   gdpPercap
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
10  Afghanistan      Asia  2002   42.129  25268405  726.734055

In [11]:
dataVar.iloc[[0,99,999],[0,1]]

         country continent
0    Afghanistan      Asia
99    Bangladesh      Asia
999     Mongolia      Asia

# 특정 나라의 데이터 확인하기

In [12]:
afd = dataVar[dataVar['country'] == 'Afghanistan']
afd

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [13]:
len(afd)

12

In [14]:
dataVar['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [15]:
dataVar[dataVar['country'] == 'Korea, Rep.']

         country continent  year  lifeExp       pop     gdpPercap
840  Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841  Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842  Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843  Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844  Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845  Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846  Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847  Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848  Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849  Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850  Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851  Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [16]:
dataVar[dataVar['country'] == 'Korea, Dem. Rep.']

              country continent  year  lifeExp       pop    gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488  1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381  1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494  1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009  2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241  3701.621503
833  Korea, Dem. Rep.      Asia  1977   67.159  16325320  4106.301249
834  Korea, Dem. Rep.      Asia  1982   69.100  17647518  4106.525293
835  Korea, Dem. Rep.      Asia  1987   70.647  19067554  4106.492315
836  Korea, Dem. Rep.      Asia  1992   69.978  20711375  3726.063507
837  Korea, Dem. Rep.      Asia  1997   67.727  21585105  1690.756814
838  Korea, Dem. Rep.      Asia  2002   66.662  22215365  1646.758151
839  Korea, Dem. Rep.      Asia  2007   67.297  23301725  1593.065480

## lifeExp 컬럼에서 최대값과 최소값 찾기

In [17]:
dataVar['lifeExp'].max()

82.603

In [18]:
dataVar['lifeExp'].min()

23.599

# 퀴즈

In [19]:
dataVar[dataVar['lifeExp']==dataVar['lifeExp'].max()]

    country continent  year  lifeExp        pop    gdpPercap
803   Japan      Asia  2007   82.603  127467972  31656.06806

In [20]:
dataVar[dataVar['lifeExp']==dataVar['lifeExp'].min()]

     country continent  year  lifeExp      pop   gdpPercap
1292  Rwanda    Africa  1992   23.599  7290203  737.068595

In [26]:
asia = dataVar[dataVar['continent']=='Asia']

In [27]:
asia['country'].unique()

array(['Afghanistan', 'Bahrain', 'Bangladesh', 'Cambodia', 'China',
       'Hong Kong, China', 'India', 'Indonesia', 'Iran', 'Iraq', 'Israel',
       'Japan', 'Jordan', 'Korea, Dem. Rep.', 'Korea, Rep.', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mongolia', 'Myanmar', 'Nepal', 'Oman',
       'Pakistan', 'Philippines', 'Saudi Arabia', 'Singapore',
       'Sri Lanka', 'Syria', 'Taiwan', 'Thailand', 'Vietnam',
       'West Bank and Gaza', 'Yemen, Rep.'], dtype=object)

In [28]:
len(asia['country'].unique())

33